# SetCutForegroundPatternId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..SetCutForegroundPatternId Method
OverrideGraphicSettings Class See Also
---
Sets the ElementId of the cut face foreground pattern override. The fill pattern must be a drafting pattern. A value of InvalidElementId means no override is set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public OverrideGraphicSettings SetCutForegroundPatternId(
	ElementId fillPatternId
)
```

Visual Basic
---
```text
Public Function SetCutForegroundPatternId ( _
	fillPatternId As ElementId _
) As OverrideGraphicSettings
```

Visual C++
---
```text
public:
OverrideGraphicSettings^ SetCutForegroundPatternId(
	ElementId^ fillPatternId
)
```

# ### Parameters
fillPatternId
    Type: Autodesk.Revit.DB..::..ElementId Value of the cut face foreground fill pattern override.
# ### Return Value
Reference to the changed object.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace